// 2. Фаренгейти

// Кевін щойно приїхав зі США і не може звикнути до нашої системи вимірювання температури. Створіть веб-додаток, де він міг ввести нові для нього градуси в Цельсіях і отримати старі добрі Фаренгейти. Додати перевірку введення користувача: якщо користувач вводить не число - повертати повідомлення про помилку та не виконувати жодних дій.

while (true) {
  const tempCelciya = prompt('Введите температуру в градусах Цельсия', '')
  if (isNaN(tempCelciya)) {
    alert('Введенные данные не являются числом. Введите температуру в градусах Цельсия')
  } else {
    const tempFaringate = (tempCelciya * 9) / 5 + 32
    console.log(
      `${tempCelciya} градусов по Цельсию = ${tempFaringate} градусов по Фарингейту`,
    )
    break;
  }
}

// const tempCelciya = prompt('Введите температуру в градусах Цельсия', '')
// if (!isNaN(tempCelciya)) {
//   const tempFaringate = (tempCelciya * 9) / 5 + 32;
//   console.log(
//     `${tempCelciya} градусов по Цельсию = ${tempFaringate} градусов по Фарингейту`,
//   )
// } else {
//   console.log('Введенные данные не являются числом')
// }


